In [ ]:
# PANDAS >> Pandas is fast powerfull flaxible and easy to use open source  data analysis more fast 
# built and top of the python programming language

# 2008 by mc kinny 
# very usefull with structure (data tabular)

import Pandas

In [2]:
import pandas as pd

In [ ]:
#  Data structure >> serise and data frame
# Serise >> 1 Dimensional in nature
# Data frame >> 2 dimensional in nature

In [4]:
type([1, 2, 3, 4])

list

In [17]:
import csv
df = [
    ['Name', 'Course', 'Price'],
    ['Angaj', 'BCA', '4000']
]

with open("df_csv.csv", 'w') as f:
    write = csv.writer(f)
    for i in df:
        write.writerow(i)

In [8]:
df

{'Name': 'Angaj', 'Roll': 112, 'class': 'Bca'}

In [7]:
import csv

student = [
    ['Name', 'course', 'price'],
    ['Angaj', 'DS', '20000'],
    ['Abhishek', 'BCA', '30000']
]

with open("example_csv.csv", "w", newline="") as f:
    writer = csv.writer(f)
    for row in student:
        writer.writerow(row)

In [23]:
type(df)

list

In [8]:
l = [1, 2, 3, 4]
s = pd.Series(l)
s

0    1
1    2
2    3
3    4
dtype: int64

In [9]:
s[0:]

0    1
1    2
2    3
3    4
dtype: int64

In [11]:
s[2:4]

2    3
3    4
dtype: int64

In [15]:
pd.Series([100, 200, 300], index=["Angaj", "Vijay", 1])

Angaj    100
Vijay    200
1        300
dtype: int64

In [16]:
d = pd.Series([100, 200, 300], index=["Angaj", "Vijay", 1])

In [17]:
type(d)

pandas.core.series.Series

In [18]:
# to see all the indax of serise
d.index

Index(['Angaj', 'Vijay', 1], dtype='object')

In [19]:
pd.DataFrame(d)

         0
Angaj  100
Vijay  200
1      300

In [22]:
s = pd.Series([2, 3, 4], index= [100, "Angaj", 200])
s

100      2
Angaj    3
200      4
dtype: int64

In [23]:
pd.DataFrame(s)

       0
100    2
Angaj  3
200    4

In [25]:
# new columns
d["New columns"] = "Gunjan"
d

Angaj             100
Vijay             200
1                 300
New columns    Gunjan
dtype: object

In [26]:
pd.DataFrame(d)

                  0
Angaj           100
Vijay           200
1               300
New columns  Gunjan

In [29]:
d["new column"] = [1, 2, 3]

In [31]:
d

Angaj                100
Vijay                200
1                    300
New columns       Gunjan
new column     [1, 2, 3]
dtype: object

In [30]:
pd.DataFrame(d)

                     0
Angaj              100
Vijay              200
1                  300
New columns     Gunjan
new column   [1, 2, 3]

In [35]:
# change column name
d.columns = ["col1", "col2", "col3"]

In [36]:
pd.DataFrame(d)

                     0
Angaj              100
Vijay              200
1                  300
New columns     Gunjan
new column   [1, 2, 3]